## Series 클래스

In [90]:
import pandas as pd

In [91]:
data = [1,2,3,4]
index = ['월', '화', '수', '목']

In [92]:
s = pd.Series(data, index)

In [93]:
s

월    1
화    2
수    3
목    4
dtype: int64

### Series  =>> index , values

In [94]:
s.index

Index(['월', '화', '수', '목'], dtype='object')

In [95]:
s.values

array([1, 2, 3, 4], dtype=int64)

In [96]:
s.array

<PandasArray>
[1, 2, 3, 4]
Length: 4, dtype: int64

### 연습문제

In [97]:
data = [500, 800, 200]
index = ['메로나', '누가바', '빠삐코']

In [98]:
s = pd.Series(data, index)

In [99]:
s

메로나    500
누가바    800
빠삐코    200
dtype: int64

In [100]:
s.index

Index(['메로나', '누가바', '빠삐코'], dtype='object')

In [101]:
s.values

array([500, 800, 200], dtype=int64)

### Series 인덱싱 / iloc 속성(변수)를 사용하여 인덱싱

In [102]:
s

메로나    500
누가바    800
빠삐코    200
dtype: int64

In [103]:
print(s.iloc[0])
print(s.iloc[1])   #iloc  =>>>>>>>>> int location (정수의 위치(인덱스 번호라는 뜻))
print(s.iloc[2])
print('******************')
print(s.loc['메로나'])
print(s.loc['누가바'])
print(s.loc['빠삐코'])

500
800
200
******************
500
800
200

### iloc, loc 인덱싱 차이

In [104]:
s.iloc[0:1]

메로나    500
dtype: int64

In [105]:
s.loc['메로나':'누가바']   #인덱스는 끝에 있는 행을 포함함

메로나    500
누가바    800
dtype: int64

### 연속하지 않는 여러 개의 값을 한번에 인덱싱 target

In [106]:
target = [0,2]
s.iloc[target]

메로나    500
빠삐코    200
dtype: int64

### 판다스 시리즈 값추가/ 삭제/ 수정

In [107]:
s.loc['보석바'] = 640

In [108]:
s

메로나    500
누가바    800
빠삐코    200
보석바    640
dtype: int64

In [109]:
print("*************")

*************

In [110]:
a1 = s.drop("보석바")

In [111]:
a1   ##삭제된 데이터

메로나    500
누가바    800
빠삐코    200
dtype: int64

In [112]:
s  ##원본파일

메로나    500
누가바    800
빠삐코    200
보석바    640
dtype: int64

In [113]:
print("*************")

*************

In [114]:
s.iloc[0] = 100  #수정값

In [115]:
s.drop('빠삐코')

메로나    100
누가바    800
보석바    640
dtype: int64

In [116]:
s

메로나    100
누가바    800
빠삐코    200
보석바    640
dtype: int64

In [117]:
s.drop('빠삐코', inplace = True)   #inplace True를 허용할시 원본파일에 적용된다

In [118]:
s

메로나    100
누가바    800
보석바    640
dtype: int64

## 브로드캐스팅 연산 시리즈 객체 전체 값에 적용

In [120]:
s = pd.Series([100,200,300])

In [121]:
print(s+10)

0    110
1    210
2    310
dtype: int64

In [122]:
high = pd.Series([51500,61200,51789,77351])
low = pd.Series([40051,54261,44789,63511])
print(high-low)

0    11449
1     6939
2     7000
3    13840
dtype: int64

### 시리즈 비교 연산

In [124]:
s = pd.Series(data = [100, 200, 300, 400, 500])
cond = s > 300
print(cond)

0    False
1    False
2    False
3     True
4     True
dtype: bool

### 시리지 필터링

In [125]:
cond

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [131]:
s[cond]   #s 시리즈에 불형 타입을 대괄호에 넣어주면 True인 값들만 넣어주게된다

3    400
4    500
dtype: int64

### 시리즈 필터링 예

In [134]:
시가 = pd.Series([100,200,300,400,600])
종가 = pd.Series([100,300,400,500,600])
cond = (시가>=300)
print(종가[cond])

2    400
3    500
4    600
dtype: int64

### DataFrame 생성   2차원 표에서 컬럼 단위로 데이터 표현

In [139]:
data = {
    "종가": [157000, 51300, 68800, 140000],
    "PER": [39.88, 8.52, 10.03, 228.38],
    "PBR": [4.38, 1.45, 0.87, 2.16]
}
index = ['네이버', '삼성전자', 'LG전자','카카오']

In [141]:
df = pd.DataFrame(data, index)

In [142]:
df

          종가     PER   PBR
네이버   157000   39.88  4.38
삼성전자   51300    8.52  1.45
LG전자   68800   10.03  0.87
카카오   140000  228.38  2.16

In [143]:
data = {
    "시가" : [980,200,300],
    "고가" : [990,300,500],
    "저가" : [920,180,300],
    "종가" : [930,180,400]    
}
index = ['비트코인', '리플', '이더리움']
df = pd.DataFrame (data , index)

In [148]:
df

       시가   고가   저가   종가
비트코인  980  990  920  930
리플    200  300  180  180
이더리움  300  500  300  400

### 데이터프레임 인덱싱과 슬라이싱

In [151]:
data = [
    [157000, 39.88, 4.38],
    [39.88, 8.52, 10.03],
    [4.38, 1.45, 2.16],
    [5.38, 1.25, 3.16]
]
index = ['네이버', '삼성전자', 'LG전자','카카오']
columns = ['종가', 'PER', 'PBR']
df = pd.DataFrame(data=data, index= index, columns=columns)

In [152]:
df

             종가    PER    PBR
네이버   157000.00  39.88   4.38
삼성전자      39.88   8.52  10.03
LG전자       4.38   1.45   2.16
카카오        5.38   1.25   3.16

In [153]:
df['종가']

네이버     157000.00
삼성전자        39.88
LG전자         4.38
카카오          5.38
Name: 종가, dtype: float64

In [155]:
df['PER']

네이버     39.88
삼성전자     8.52
LG전자     1.45
카카오      1.25
Name: PER, dtype: float64

In [158]:
df['종가'].iloc[3]

5.38

### 멀티로우 선택

df.iloc[[0,1]]

### 로우 슬라이싱

In [187]:
df.iloc[0:3]

             종가    PER    PBR
네이버   157000.00  39.88   4.38
삼성전자      39.88   8.52  10.03
LG전자       4.38   1.45   2.16

### 판다스 데이터프레임 값과 영역 접근

In [188]:
df

             종가    PER    PBR
네이버   157000.00  39.88   4.38
삼성전자      39.88   8.52  10.03
LG전자       4.38   1.45   2.16
카카오        5.38   1.25   3.16

In [189]:
df.loc['네이버', '종가']

157000.0

In [190]:
df.iloc[0 ,1]

39.88

In [191]:
df.iloc[[0,1,2],[0,1]]

             종가    PER
네이버   157000.00  39.88
삼성전자      39.88   8.52
LG전자       4.38   1.45

In [192]:
df.iloc[0:3,[0,1]]

             종가    PER
네이버   157000.00  39.88
삼성전자      39.88   8.52
LG전자       4.38   1.45

### 판다스 데이터프레임 추가 삭제 컬럼 추가

In [194]:
import pyupbit

In [201]:
df = pyupbit.get_ohlcv('KRW-BTC')
df.head()

,open,high,low,close,volume,value
2022-08-21 09:00:00,29350000.0,29760000.0,29016000.0,29459000.0,3786.406886,1.113137e+11
2022-08-22 09:00:00,29458000.0,29554000.0,28857000.0,29260000.0,4297.803752,1.254949e+11
2022-08-23 09:00:00,29261000.0,29528000.0,28701000.0,29307000.0,3763.613823,1.098211e+11
2022-08-24 09:00:00,29287000.0,29695000.0,28950000.0,29104000.0,3125.560121,9.143187e+10
2022-08-25 09:00:00,29103000.0,29500000.0,29036000.0,29300000.0,3452.121992,1.012016e+11

In [196]:
df['range'] = df['high']- df['low']

In [206]:
df2 = df.drop('value', axis = 1, inplace = True)   ## axis => 0일때는 행을, 1일때는 열을 선택한다는뜻

In [208]:
df

,open,high,low,close,volume
2022-08-21 09:00:00,29350000.0,29760000.0,29016000.0,29459000.0,3786.406886
2022-08-22 09:00:00,29458000.0,29554000.0,28857000.0,29260000.0,4297.803752
2022-08-23 09:00:00,29261000.0,29528000.0,28701000.0,29307000.0,3763.613823
2022-08-24 09:00:00,29287000.0,29695000.0,28950000.0,29104000.0,3125.560121
2022-08-25 09:00:00,29103000.0,29500000.0,29036000.0,29300000.0,3452.121992
...,...,...,...,...,...
2023-03-04 09:00:00,29710000.0,29907000.0,29638000.0,29838000.0,2222.291205
2023-03-05 09:00:00,29837000.0,30097000.0,29650000.0,29982000.0,2189.453910
2023-03-06 09:00:00,29982000.0,30066000.0,29638000.0,29769000.0,2405.786232
2023-03-07 09:00:00,29769000.0,29978000.0,29250000.0,29579000.0,7624.354355
2023-03-08 09:00:00,29579000.0,29660000.0,29500000.0,29540000.0,1187.690877

### 판다스 시계열 데이터와 인덱스

In [209]:
date = ["2022-03-08"]
index = pd.to_datetime(date)
print(type(index))   ##리스트 안에 묶여있음으로 여러개 일 수 있어 DatetimeIndex

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

In [211]:
date = "2022-03-08"
index = pd.to_datetime(date)
print(type(index)) ##한개 밖에 존재함으로 timestamp

<class 'pandas._libs.tslibs.timestamps.Timestamp'>

### 로우 추가

In [214]:
date = "2022-08-21 09:00:00"
index = pd.to_datetime(date)
df.loc[index]= [190,100,100,100,100]

In [215]:
df

,open,high,low,close,volume
2022-08-21 09:00:00,190.0,100.0,100.0,100.0,100.000000
2022-08-22 09:00:00,29458000.0,29554000.0,28857000.0,29260000.0,4297.803752
2022-08-23 09:00:00,29261000.0,29528000.0,28701000.0,29307000.0,3763.613823
2022-08-24 09:00:00,29287000.0,29695000.0,28950000.0,29104000.0,3125.560121
2022-08-25 09:00:00,29103000.0,29500000.0,29036000.0,29300000.0,3452.121992
...,...,...,...,...,...
2023-03-05 09:00:00,29837000.0,30097000.0,29650000.0,29982000.0,2189.453910
2023-03-06 09:00:00,29982000.0,30066000.0,29638000.0,29769000.0,2405.786232
2023-03-07 09:00:00,29769000.0,29978000.0,29250000.0,29579000.0,7624.354355
2023-03-08 09:00:00,29579000.0,29660000.0,29500000.0,29540000.0,1187.690877
2022-01-01 00:00:00,190.0,100.0,100.0,100.0,100.000000

In [220]:
df.drop("2022-08-21 09:00:00", axis=0, inplace = True)

In [221]:
df

,open,high,low,close,volume
2022-08-22 09:00:00,29458000.0,29554000.0,28857000.0,29260000.0,4297.803752
2022-08-23 09:00:00,29261000.0,29528000.0,28701000.0,29307000.0,3763.613823
2022-08-24 09:00:00,29287000.0,29695000.0,28950000.0,29104000.0,3125.560121
2022-08-25 09:00:00,29103000.0,29500000.0,29036000.0,29300000.0,3452.121992
2022-08-26 09:00:00,29299000.0,29655000.0,27790000.0,27969000.0,7729.246705
...,...,...,...,...,...
2023-03-04 09:00:00,29710000.0,29907000.0,29638000.0,29838000.0,2222.291205
2023-03-05 09:00:00,29837000.0,30097000.0,29650000.0,29982000.0,2189.453910
2023-03-06 09:00:00,29982000.0,30066000.0,29638000.0,29769000.0,2405.786232
2023-03-07 09:00:00,29769000.0,29978000.0,29250000.0,29579000.0,7624.354355
2023-03-08 09:00:00,29579000.0,29660000.0,29500000.0,29540000.0,1187.690877

### 브로드캐스팅

In [236]:
df = pyupbit.get_ohlcv("KRW-BTC")
df

,open,high,low,close,volume,value
2022-08-21 09:00:00,29350000.0,29760000.0,29016000.0,29459000.0,3786.406886,1.113137e+11
2022-08-22 09:00:00,29458000.0,29554000.0,28857000.0,29260000.0,4297.803752,1.254949e+11
2022-08-23 09:00:00,29261000.0,29528000.0,28701000.0,29307000.0,3763.613823,1.098211e+11
2022-08-24 09:00:00,29287000.0,29695000.0,28950000.0,29104000.0,3125.560121,9.143187e+10
2022-08-25 09:00:00,29103000.0,29500000.0,29036000.0,29300000.0,3452.121992,1.012016e+11
...,...,...,...,...,...,...
2023-03-04 09:00:00,29710000.0,29907000.0,29638000.0,29838000.0,2222.291205,6.621347e+10
2023-03-05 09:00:00,29837000.0,30097000.0,29650000.0,29982000.0,2189.453910,6.548486e+10
2023-03-06 09:00:00,29982000.0,30066000.0,29638000.0,29769000.0,2405.786232,7.180334e+10
2023-03-07 09:00:00,29769000.0,29978000.0,29250000.0,29579000.0,7624.354355,2.270621e+11
2023-03-08 09:00:00,29579000.0,29660000.0,29434000.0,29447000.0,1530.331406,4.522878e+10

In [237]:
df['open']+100

2022-08-21 09:00:00    29350100.0
2022-08-22 09:00:00    29458100.0
2022-08-23 09:00:00    29261100.0
2022-08-24 09:00:00    29287100.0
2022-08-25 09:00:00    29103100.0
                          ...
2023-03-04 09:00:00    29710100.0
2023-03-05 09:00:00    29837100.0
2023-03-06 09:00:00    29982100.0
2023-03-07 09:00:00    29769100.0
2023-03-08 09:00:00    29579100.0
Name: open, Length: 200, dtype: float64

### 데이터프레임 필터링

In [238]:
cond = df['close'] > df['open']

In [239]:
cond

2022-08-21 09:00:00     True
2022-08-22 09:00:00    False
2022-08-23 09:00:00     True
2022-08-24 09:00:00    False
2022-08-25 09:00:00     True
                       ...
2023-03-04 09:00:00     True
2023-03-05 09:00:00     True
2023-03-06 09:00:00    False
2023-03-07 09:00:00    False
2023-03-08 09:00:00    False
Length: 200, dtype: bool

In [240]:
df.head(2)

,open,high,low,close,volume,value
2022-08-21 09:00:00,29350000.0,29760000.0,29016000.0,29459000.0,3786.406886,1.113137e+11
2022-08-22 09:00:00,29458000.0,29554000.0,28857000.0,29260000.0,4297.803752,1.254949e+11

### 컬럼 시프트  (데이터 프레임의 연산은 기본적으로 같은 인덱스에 있는 컬럼과 컬럼의 사이에 적용됨)

In [241]:
df

,open,high,low,close,volume,value
2022-08-21 09:00:00,29350000.0,29760000.0,29016000.0,29459000.0,3786.406886,1.113137e+11
2022-08-22 09:00:00,29458000.0,29554000.0,28857000.0,29260000.0,4297.803752,1.254949e+11
2022-08-23 09:00:00,29261000.0,29528000.0,28701000.0,29307000.0,3763.613823,1.098211e+11
2022-08-24 09:00:00,29287000.0,29695000.0,28950000.0,29104000.0,3125.560121,9.143187e+10
2022-08-25 09:00:00,29103000.0,29500000.0,29036000.0,29300000.0,3452.121992,1.012016e+11
...,...,...,...,...,...,...
2023-03-04 09:00:00,29710000.0,29907000.0,29638000.0,29838000.0,2222.291205,6.621347e+10
2023-03-05 09:00:00,29837000.0,30097000.0,29650000.0,29982000.0,2189.453910,6.548486e+10
2023-03-06 09:00:00,29982000.0,30066000.0,29638000.0,29769000.0,2405.786232,7.180334e+10
2023-03-07 09:00:00,29769000.0,29978000.0,29250000.0,29579000.0,7624.354355,2.270621e+11
2023-03-08 09:00:00,29579000.0,29660000.0,29434000.0,29447000.0,1530.331406,4.522878e+10

In [243]:
df.drop(['volume', 'value'], axis = 1, inplace=True)

In [244]:
df

                           open        high         low       close
2022-08-21 09:00:00  29350000.0  29760000.0  29016000.0  29459000.0
2022-08-22 09:00:00  29458000.0  29554000.0  28857000.0  29260000.0
2022-08-23 09:00:00  29261000.0  29528000.0  28701000.0  29307000.0
2022-08-24 09:00:00  29287000.0  29695000.0  28950000.0  29104000.0
2022-08-25 09:00:00  29103000.0  29500000.0  29036000.0  29300000.0
...                         ...         ...         ...         ...
2023-03-04 09:00:00  29710000.0  29907000.0  29638000.0  29838000.0
2023-03-05 09:00:00  29837000.0  30097000.0  29650000.0  29982000.0
2023-03-06 09:00:00  29982000.0  30066000.0  29638000.0  29769000.0
2023-03-07 09:00:00  29769000.0  29978000.0  29250000.0  29579000.0
2023-03-08 09:00:00  29579000.0  29660000.0  29434000.0  29447000.0

[200 rows x 4 columns]

In [245]:
df['close_shift1'] = df['close'].shift(1)

In [246]:
df

,open,high,low,close,close_shift1
2022-08-21 09:00:00,29350000.0,29760000.0,29016000.0,29459000.0,NaN
2022-08-22 09:00:00,29458000.0,29554000.0,28857000.0,29260000.0,29459000.0
2022-08-23 09:00:00,29261000.0,29528000.0,28701000.0,29307000.0,29260000.0
2022-08-24 09:00:00,29287000.0,29695000.0,28950000.0,29104000.0,29307000.0
2022-08-25 09:00:00,29103000.0,29500000.0,29036000.0,29300000.0,29104000.0
...,...,...,...,...,...
2023-03-04 09:00:00,29710000.0,29907000.0,29638000.0,29838000.0,29709000.0
2023-03-05 09:00:00,29837000.0,30097000.0,29650000.0,29982000.0,29838000.0
2023-03-06 09:00:00,29982000.0,30066000.0,29638000.0,29769000.0,29982000.0
2023-03-07 09:00:00,29769000.0,29978000.0,29250000.0,29579000.0,29769000.0
2023-03-08 09:00:00,29579000.0,29660000.0,29434000.0,29447000.0,29579000.0

In [247]:
df['diff'] = df['close']-df['close_shift1']

In [248]:
df

,open,high,low,close,close_shift1,diff
2022-08-21 09:00:00,29350000.0,29760000.0,29016000.0,29459000.0,NaN,NaN
2022-08-22 09:00:00,29458000.0,29554000.0,28857000.0,29260000.0,29459000.0,-199000.0
2022-08-23 09:00:00,29261000.0,29528000.0,28701000.0,29307000.0,29260000.0,47000.0
2022-08-24 09:00:00,29287000.0,29695000.0,28950000.0,29104000.0,29307000.0,-203000.0
2022-08-25 09:00:00,29103000.0,29500000.0,29036000.0,29300000.0,29104000.0,196000.0
...,...,...,...,...,...,...
2023-03-04 09:00:00,29710000.0,29907000.0,29638000.0,29838000.0,29709000.0,129000.0
2023-03-05 09:00:00,29837000.0,30097000.0,29650000.0,29982000.0,29838000.0,144000.0
2023-03-06 09:00:00,29982000.0,30066000.0,29638000.0,29769000.0,29982000.0,-213000.0
2023-03-07 09:00:00,29769000.0,29978000.0,29250000.0,29579000.0,29769000.0,-190000.0
2023-03-08 09:00:00,29579000.0,29660000.0,29434000.0,29447000.0,29579000.0,-132000.0